Revit 2027 API
FunctionId.File Property
The name of the file including the function throwing an exception.
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string File { get; }
Public ReadOnly Property File As String
	Get
public:
property String^ File {
	String^ get ();
}
member File : string with get
Property Value
String
See Also
Reference
FunctionId Class
Autodesk.Revit.Exceptions Namespace